---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer.GetApplicationId
source: html/b0a63d7f-1580-0ad9-6d45-fcd31e5ebba1.htm
---
# Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer.GetApplicationId Method

Reports this server's application ID.

## Syntax (C#)
```csharp
string GetApplicationId()
```

## Returns
The application ID.